
var  local_database= [{
    date: "Nov 18 2019",
    title: "正是虾肥蟹壮时",
    imgSrc: "/images/post/crab.png",
    avatar: "/images/avatar/2.png",
    content: "菊黄蟹正肥，品尝秋之味。徐志摩把,“看初花的荻芦”和“到楼外楼吃蟹”,并列为秋天来杭州不能错过的风雅之事；用林妹妹的话讲是“螯封嫩玉双双满，",
    reading: "112",
    collection: "96",
      headImgSrc:"/images/post/crab.png",
      author:"林白衣",
      dateTime: "24小时前",
      detail: "菊黄蟹正肥，品尝秋之味。徐志摩把“看初花的荻芦”和“到楼外楼吃蟹”并列为秋天来杭州不能错过的风雅之事；用林妹妹的话讲是“螯封嫩玉双双满，壳凸红脂块块香”；在《世说新语》里，晋毕卓更是感叹“右手持酒杯，左手持蟹螯，拍浮酒船中，便足了一生矣。”漫漫人生长路，美食与爱岂可辜负？于是作为一个吃货，突然也很想回味一下属于我的味蕾记忆。记忆中的秋蟹，是家人的味道，弥漫着浓浓的亲情。\n\n是谁来自山川湖海，却囿于昼夜，厨房与爱？ 是母亲，深思熟虑，聪明耐心。吃蟹前，总会拿出几件工具，煞有介事而乐此不疲。告诉我们螃蟹至寒，需要佐以姜茶以祛寒，在配备的米醋小碟里，亦添入姜丝与紫苏，前者驱寒后者增香。泡好菊花茶，岁月静好，我们静等。",
    postId: 0,
    music: {
      url: "http://music.163.com/song/191171/?userid=1334757364",
    title: "夜夜夜夜-齐秦",
    coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001TEc6V0kjpVC.jpg?max_age=2592000"
  }
  },
  {
    title: "比利·林恩的中场故事",
    content: "一 “李安是一位绝不会重复自己的导演，本片将极富原创性李安众所瞩目的新片《比利林恩漫长的中场休息》，正式更名《半场无战事》。",
    imgSrc: "/images/post/bl.png",
    reading: 62,
    detail: "一 “李安是一位绝不会重复自己的导演，本片将极富原创性”李安众所瞩目的新片《比利林恩漫长的中场休息》，正式更名《半场无战事》。预告片首次曝光后，被视作是明年奥斯卡种子选手。该片根据同名畅销书改编。原著小说荣获美国国家图书奖。也被BBC评为21世纪最伟大的12本英文小说之一。影片讲述一位19岁德州男孩的比利·林恩入伍参加伊战，在一次交火中他大难不死，意外与战友成为大众的关注焦点，并被塑造成英雄。之后他们返回国内，在橄榄球赛中场休息时授勋。这名战争英雄却面临前所未有的心灵煎熬……李安为什么选中这部电影来拍？因为李安想要挑战前所未有的技术难题：以120帧每秒的速度、4K、3D技术全面结合，来掀起一场电影视觉革命。什么意思？所谓“电影是24格每秒的谎言”，其中的24格，就是帧数。",
    collection: 92,
    dateTime: "24小时前",
    headImgSrc: "/images/post/bl.png",
    author: "迷的城",
    date: "Nov 20 2019",
    avatar: "/images/avatar/1.png",
    postId: 1,
    music: {
      url: "http://music.163.com/song/media/outer/url?id=108220.mp3",
      title: "鬼迷心窍-李宗盛",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000002xOmp62kqSic.jpg?max_age=2592000"
    }
  },
  {
    //按住alt + shift + F 可以格式化代码样式
    title: "当我们在谈论经济学时，我们在谈论什么?",
    content: "引言在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：...",
    detail: "1 引言\n\n在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：有些人套用“经济理论“的知识去解释现实中发生的经济事件，结果发现很多事情讲不通，或者发现”理论告诉我们的“与现实发生的是相反的。也有学生经常跟我说：经济学有什么用？为了说明这个，我经常从两个方面来进行解释，尝试用我个人所擅长的解决问题的视角和他们能够听懂的方法来说明经济学是什么，它的作用边界在哪里：\r\n\n2 ”简笔素描“与”油画肖像“我们给人画肖像画，可以用简笔素描，也可以用油画肖像。油画肖像可以在最大程度上保存了人物的各方面的细节和特点，而简笔素描则忽略了很多细节。尽管简笔素描忽略了人物的许多细节，但我们仍旧能够很容易的认出画中的人物是谁。为什么？因为这种方法保留了人物最显著的特征，以至于我们可以忽略其次要特征而对人物做出判定。\n\n2.1 ”简笔素描“对于绝大多数的非经济学专业大众而言（经济学相关专业硕士学历以上），人们所接触到的经济学都是初级微观经济学。所谓的初级微观经济学，对于经济问题的”画法“就是一种”简笔素描“。比如初级微观经济学教材中广为使用的这种一元一次需求函数：y=bx+a，需求量的唯一变量是产品价格。但仅凭直觉我们就可以断言，现实中影响需求量的因素绝不止价格这一种，因此我们可以认为这个模型对经济问题的描述是失真的。然而但这种失真却是必要的和有意义的，其意义在与它利于揭示价格对于需求的影响，而不在于否定影响需求的其他因素——",
    imgSrc: "/images/post/sls.jpg",
    headImgSrc: "/images/post/sls.jpg",
    reading: 62,
    collection: 92,
    author: "知乎",
    date: "Nov 12 2019",
    dateTime: "三天前",
    avatar: "/images/avatar/3.png",
    postId: 2,
    music: {
      url: "http://music.163.com/song/media/outer/url?id=27538254.mp3",
      title: "女儿情-万晓利",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000"
    }
  },
  {
    title: "美丽厦门",
    content: "在祖国的东海沿岸，有一个璀璨之珠叫厦门，那里还有一个美丽的岛屿鼓浪屿，也叫钢琴之岛。",
    imgSrc: "/images/post/xm3.png",
    reading: 102,
    detail: "对于厦门小编的认识其实是不多的，而且在之前小编关于厦门的话只能是说知道厦门有一个厦门大学的。不过随着这些年来小编我对于旅游这一项目的越来越关注，便也慢慢的开始了解起厦门这个地方来。厦门真的是一个十分浪漫的地方，不管是从这儿的一些旅游景点来看，还是从它这儿的一些住宿环境等吃住的方面来看，似乎都是透露着一股浪漫的气息的。让小编我来带你们逛一逛厦门的几个地方吧！当你来到了厦门的话，你切记一定不能错过这个位于厦门的一所高学府的呢！厦门大学可是一所被称为是中国最美的大学的。而且小编我也可以保证，它是一定对得起这个称号的。\n\n当我们进入校园内，你便能发现在这座校园里处处都可以说是一副美丽的景象的。我们可以去布满了涂鸦的芙蓉隧道逛一逛，真的会给人一种十分浪漫的感觉的。和自己的爱人一起漫步在这厦大的校园内真的是一件很幸福很幸福的事情哦！当你在厦门大学里面逛累的时候，我们也可以走出校园。那么你将会看到外面有着大片大片的独立出来的小西餐厅馆。里面的装修都是十分的有情调的那种。价格方面的话你们也不用担心的，虽然厦门市一个高消费的地方吧，但是毕竟是在学校周围的，价格也都是十分的实惠的呢！再一个你若是带着自己的孩子来到厦门大学的话，可能也会对你的孩子起到一个激励的作用的。毕竟人们都是向往着一些美好的地方的。当你的孩子看到厦门大学的这一番美景之后说不定会被其深深打动，然后立志以后的他（她）也一定要考入到这所学校来的。\n\n顶澳仔猫街这里真的可以说是一家非常独特的地方的。在这条小小的街道这里，几乎全部都是有关于猫的主题的小店铺。不管是吃的店铺还是各种卖小东西的店铺都是以猫为主旨来装扮的。这里真的可以是喜爱猫的人的天堂呢！猫本身就是一种十分温顺的动物，这就难怪如今有很多的人都愿意养小猫这种动物的。小编我也有一位朋友真的可以说是猫的忠实粉丝的，她真的非常的喜欢猫这种动物的。我相信一些喜欢猫的人性格也是一定都很温和的吧！就算你是对猫并没有什么感觉的人，当你来到这个地方后也一定会被它这里的这种气氛所渲染的，说不定你会发现猫原来是这么可爱的一种动物的！",
    collection: 92,
    dateTime: "24小时前",
    headImgSrc: "/images/post/xm1.png",
    author: "猫是猫的猫",
    date: "Nov 20 2019",
    avatar: "/images/avatar/5.png",
    postId: 3,
    music: {
      url: "http://music.163.com/song/media/outer/url?id=108119.mp3",
      title: "恋恋风尘-老狼",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001VaXQX1Z1Imq.jpg?max_age=2592000",
    }
  },
  {
    title: "从视觉到触觉 这款VR手套能给你真实触感",
    content: "8月29日消息，据国外媒体VentureBeat报道，一家名为Dexta Robotics的公司最近发布了一款有望变革虚拟现实手部追踪与交互方式的新产品",
    imgSrc: "/images/post/vr.png",
    reading: 102,
    detail: "消息，据国外媒体VentureBeat报道，一家名为Dexta Robotics的公司最近发布了一款有望变革虚拟现实手部追踪与交互方式的新产品。该产品名为“Dexmo”，它是一款像手套那样戴在手上使用的未来主义外骨骼。它内置大量的元件，能够与VR体验进行交互，可帮助你感觉握在你的双手的虚拟物体。Dexmo据Dexta称，“Dexmo是一款针对你的双手的机械外骨骼。它能够捕捉你的手部运动，以及提供即时的力反馈。有了Dexmo，你可以感受到虚拟物体的大小、形状和坚硬度。你可以接触数字世界。”市面上已经有数款产品旨在处理虚拟现实中的手部交互，也有相关的产品即将要进入市场。例如，颇受欢迎的HTC Vive头盔配有一副控制器，其控制器能够使得追踪系统看到你的双手，让你可以用它们来在特定体验中与物体进行交互。今年晚些时候，Oculus将开始出货类似的手部控制产品Oculus Touch。10月，索尼也将开始出货配备两个PlayStation Move手部控制器的PS VR。Leap Motion甚至更进一步：利用传感器来追踪手指和手部的运动。",
    collection: 26,
    dateTime: "24小时前",
    headImgSrc: "/images/post/vr.png",
    author: "深白色",
    date: "Nov 20 2019",
    avatar: "/images/avatar/3.png",
    postId: 4,
    music: {
      url: "http://music.163.com/song/media/outer/url?id=188204.mp3",
      title: "沉默是金-张国荣",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000003at0mJ2YrR2H.jpg?max_age=2592000"
    }
  },
  {
    title: "《权力的游戏》里的艾莉亚·史塔克",
    content: "凭借自己的坚定信念树立了自我意识，完成了家族复仇",
    imgSrc: "/images/aly.png",
    reading: 96,
    detail: "艾莉亚从小就明白，她永远不会像姐姐珊莎一样成为人们期望的淑女，她经常向哥哥和父亲证明，自己是一名优秀的神射手，轻易地就超过了布兰。当她父亲奈德告诉她，有一天她会嫁给一位伟大的领主，生下一群漂亮的孩子时，艾莉亚马上回应道：那不是我。尽管剧中许多角色都在努力定位自己，但只有艾莉亚是唯一一个从第一集就知道自己是谁的角色。\n\n在目睹了父亲奈德·史塔克的死亡后，艾莉亚知道君临不再安全，只好离开君临前往长城寻找哥哥琼恩·雪诺。正是在寻找琼恩·雪诺的路上，守夜人尤伦给了二丫列出死亡名单的想法，这份名单也成了艾莉亚继续前进的动力。在四处躲藏的旅程中，二丫初次与一位自称贾昆·赫加尔的人相遇，并在泰温·兰尼斯特身边学到了计划并坚持到底的重要性。在逃离赫伦堡时，贾坤给了她一枚硬币，并教会她那句：“凡人皆有一死”。\n\n艾莉亚、詹德利和Hot Pie（小胖子）逃离赫伦堡后，继续向奔流城出发，途中被无旗兄弟会拦截。艾莉亚的死亡名单从这里正式开始，也是在这里第一次与猎狗相遇。于是，艾莉亚和猎狗的传奇故事就这样开始了.当他们到达孪河城后，得知了罗柏·史塔克在红色婚礼上的遭遇。二丫在自己的名单上又添加了几个名字，并冲动的杀死了一名弗雷家族的士兵，艾莉亚的复仇之路也由此开始。",
    collection: 26,
    dateTime: "21小时前",
    headImgSrc: "/images/aly.png",
    author: "深白色",
    date: "Nov 20 2019",
    avatar: "/images/avatar/4.png",
    postId: 5,
    music: {
      url: "http://music.163.com/song/media/outer/url?id=152428.mp3",
      title: "朋友-谭咏麟",
      coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004eGsCN3SUheO.jpg?max_age=2592000"
    }
  },
]


module.exports= {
  postList:local_database
}